app/controllers/articles_controller.rb

  	def index
  		if params[:category].blank?
  			@articles = Article.all.order("created_at DESC")
  		else
  			@category_id = Category.find_by(name: params[:category]).id
  			@articles = Article.where(category_id: @category_id).order("created_at DESC")
---
SELECT "categories".* FROM "categories"
SELECT "articles".* FROM "articles" ORDER BY created_at DESC
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Art"], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."category_id" = ? ORDER BY created_at DESC  [["category_id", 1]]

  	def create
  		@article = current_user.articles.build(article_params)
  		if @article.save
---
INSERT INTO "articles" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Test Article"], ["content", "Blaha blah blaaa"], ["created_at", 2017-03-27 19:01:19 UTC], ["updated_at", 2017-03-27 19:01:19 UTC]]

  	def update
  		if @article.update(article_params)
---
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Apple Watch Updates"], ["updated_at", 2017-03-29 18:07:01 UTC], ["id", 4]]

  	def find_article
  		@article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]